app/views/users/index.html.erb

            <%= link_to user.username, user_path(user), class: "userName" %>
            <p>投稿数：<%= user.posts.count %> </p>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]