app/views/users/show.html.erb

<div class="user-posts-show">
<% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]