app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # @post = Post.find(params[:id])
    @post = Post.find_by(id: params[:id])

INSERT INTO "posts" ("user_id", "title", "body", "image_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["title", "ナオキブログ"], ["body", "こんにちあこんいちは"], ["image_name", "photo.jpg"], ["created_at", "2020-10-03 09:35:23.547915"], ["updated_at", "2020-10-03 09:35:23.547915"]]
---
  def create
    @post = Post.new(
      title: params[:title],
      body: params[:body],
      image_name: "photo.jpg"
    )
    @post.user_id = current_user.id
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "image_name" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "てすとえゔぁ"], ["image_name", "3.jpg"], ["updated_at", "2020-10-03 14:13:36.182060"], ["id", 3]]
---
  def update
    @post = Post.find(params[:id])
    @post.title = params[:title]
    @post.body = params[:body]
    if params[:image]
      @post.image_name = "#{@post.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@post.image_name}", image.read)
    end
    if @post.save