app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "#<ActionDispatch::Http::UploadedFile:0x00007f0aa813baf0>"], ["updated_at", "2020-10-03 04:37:36.051481"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)